<net version="2" batch="1" name="deploy_ssd_resnet50_300">
  <layers>
    <layer precision="FP16" id="1" type="Input" name="data">
      <output>
        <port id="1">
          <dim>1</dim>
          <dim>3</dim>
          <dim>224</dim>
          <dim>224</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="2" type="ScaleShift" name="ScaleShift_bn_data">
      <input>
        <port id="3">
          <dim>1</dim>
          <dim>3</dim>
          <dim>224</dim>
          <dim>224</dim>
        </port>
      </input>
      <output>
        <port id="2">
          <dim>1</dim>
          <dim>3</dim>
          <dim>224</dim>
          <dim>224</dim>
        </port>
      </output>
      <weights size="6" offset="0"/>
      <biases size="6" offset="6"/>
    </layer>
    <layer precision="FP16" id="3" type="Convolution" name="Convolution_conv0">
      <convolution_data dilation-y="1" output="64" dilation-x="1" kernel-y="7" kernel-x="7" pad-y="3" pad-x="3" stride-y="2" group="1" stride-x="2"/>
      <input>
        <port id="5">
          <dim>1</dim>
          <dim>3</dim>
          <dim>224</dim>
          <dim>224</dim>
        </port>
      </input>
      <output>
        <port id="4">
          <dim>1</dim>
          <dim>64</dim>
          <dim>112</dim>
          <dim>112</dim>
        </port>
      </output>
      <weights size="18816" offset="12"/>
      <biases size="128" offset="18828"/>
    </layer>
    <layer precision="FP16" id="4" type="ReLU" name="ReLU_relu0">
      <input>
        <port id="7">
          <dim>1</dim>
          <dim>64</dim>
          <dim>112</dim>
          <dim>112</dim>
        </port>
      </input>
      <output>
        <port id="6">
          <dim>1</dim>
          <dim>64</dim>
          <dim>112</dim>
          <dim>112</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="5" type="Pooling" name="Pooling_pooling0">
      <pooling_data rounding-type="ceil" pad-x="1" kernel-y="3" kernel-x="3" pad-y="1" stride-y="2" pool-method="max" stride-x="2"/>
      <input>
        <port id="9">
          <dim>1</dim>
          <dim>64</dim>
          <dim>112</dim>
          <dim>112</dim>
        </port>
      </input>
      <output>
        <port id="8">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="6" type="ScaleShift" name="ScaleShift_stage1_unit1_bn1">
      <input>
        <port id="11">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="10">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="128" offset="18956"/>
      <biases size="128" offset="19084"/>
    </layer>
    <layer precision="FP16" id="7" type="ReLU" name="ReLU_stage1_unit1_relu1">
      <input>
        <port id="13">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="12">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="8" type="Convolution" name="Convolution_stage1_unit1_conv1">
      <convolution_data dilation-y="1" output="64" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="15">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="14">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="8192" offset="19212"/>
      <biases size="128" offset="27404"/>
    </layer>
    <layer precision="FP16" id="9" type="ReLU" name="ReLU_stage1_unit1_relu2">
      <input>
        <port id="17">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="16">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="10" type="Convolution" name="Convolution_stage1_unit1_conv2">
      <convolution_data dilation-y="1" output="64" dilation-x="1" kernel-y="3" kernel-x="3" pad-y="1" pad-x="1" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="19">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="18">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="73728" offset="27532"/>
      <biases size="128" offset="101260"/>
    </layer>
    <layer precision="FP16" id="11" type="ReLU" name="ReLU_stage1_unit1_relu3">
      <input>
        <port id="21">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="20">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="12" type="Convolution" name="Convolution_stage1_unit1_conv3">
      <convolution_data dilation-y="1" output="256" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="23">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="22">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="32768" offset="101388"/>
    </layer>
    <layer precision="FP16" id="13" type="Convolution" name="Convolution_stage1_unit1_sc">
      <convolution_data dilation-y="1" output="256" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="25">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="24">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="32768" offset="134156"/>
    </layer>
    <layer precision="FP16" id="14" type="Eltwise" name="Eltwise__plus0">
      <elementwise_data operation="sum"/>
      <input>
        <port id="27">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
        <port id="28">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="26">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="15" type="ScaleShift" name="ScaleShift_stage1_unit2_bn1">
      <input>
        <port id="30">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="29">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="512" offset="166924"/>
      <biases size="512" offset="167436"/>
    </layer>
    <layer precision="FP16" id="16" type="ReLU" name="ReLU_stage1_unit2_relu1">
      <input>
        <port id="32">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="31">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="17" type="Convolution" name="Convolution_stage1_unit2_conv1">
      <convolution_data dilation-y="1" output="64" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="34">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="33">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="32768" offset="167948"/>
      <biases size="128" offset="200716"/>
    </layer>
    <layer precision="FP16" id="18" type="ReLU" name="ReLU_stage1_unit2_relu2">
      <input>
        <port id="36">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="35">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="19" type="Convolution" name="Convolution_stage1_unit2_conv2">
      <convolution_data dilation-y="1" output="64" dilation-x="1" kernel-y="3" kernel-x="3" pad-y="1" pad-x="1" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="38">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="37">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="73728" offset="200844"/>
      <biases size="128" offset="274572"/>
    </layer>
    <layer precision="FP16" id="20" type="ReLU" name="ReLU_stage1_unit2_relu3">
      <input>
        <port id="40">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="39">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="21" type="Convolution" name="Convolution_stage1_unit2_conv3">
      <convolution_data dilation-y="1" output="256" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="42">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="41">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="32768" offset="274700"/>
    </layer>
    <layer precision="FP16" id="22" type="Eltwise" name="Eltwise__plus1">
      <elementwise_data operation="sum"/>
      <input>
        <port id="44">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
        <port id="45">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="43">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="23" type="ScaleShift" name="ScaleShift_stage1_unit3_bn1">
      <input>
        <port id="47">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="46">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="512" offset="307468"/>
      <biases size="512" offset="307980"/>
    </layer>
    <layer precision="FP16" id="24" type="ReLU" name="ReLU_stage1_unit3_relu1">
      <input>
        <port id="49">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="48">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="25" type="Convolution" name="Convolution_stage1_unit3_conv1">
      <convolution_data dilation-y="1" output="64" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="51">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="50">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="32768" offset="308492"/>
      <biases size="128" offset="341260"/>
    </layer>
    <layer precision="FP16" id="26" type="ReLU" name="ReLU_stage1_unit3_relu2">
      <input>
        <port id="53">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="52">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="27" type="Convolution" name="Convolution_stage1_unit3_conv2">
      <convolution_data dilation-y="1" output="64" dilation-x="1" kernel-y="3" kernel-x="3" pad-y="1" pad-x="1" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="55">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="54">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="73728" offset="341388"/>
      <biases size="128" offset="415116"/>
    </layer>
    <layer precision="FP16" id="28" type="ReLU" name="ReLU_stage1_unit3_relu3">
      <input>
        <port id="57">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="56">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="29" type="Convolution" name="Convolution_stage1_unit3_conv3">
      <convolution_data dilation-y="1" output="256" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="59">
          <dim>1</dim>
          <dim>64</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="58">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="32768" offset="415244"/>
    </layer>
    <layer precision="FP16" id="30" type="Eltwise" name="Eltwise__plus2">
      <elementwise_data operation="sum"/>
      <input>
        <port id="61">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
        <port id="62">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="60">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="31" type="ScaleShift" name="ScaleShift_stage2_unit1_bn1">
      <input>
        <port id="64">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="63">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="512" offset="448012"/>
      <biases size="512" offset="448524"/>
    </layer>
    <layer precision="FP16" id="32" type="ReLU" name="ReLU_stage2_unit1_relu1">
      <input>
        <port id="66">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="65">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="33" type="Convolution" name="Convolution_stage2_unit1_conv1">
      <convolution_data dilation-y="1" output="128" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="68">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="67">
          <dim>1</dim>
          <dim>128</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
      <weights size="65536" offset="449036"/>
      <biases size="256" offset="514572"/>
    </layer>
    <layer precision="FP16" id="34" type="ReLU" name="ReLU_stage2_unit1_relu2">
      <input>
        <port id="70">
          <dim>1</dim>
          <dim>128</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="69">
          <dim>1</dim>
          <dim>128</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="35" type="Convolution" name="Convolution_stage2_unit1_conv2">
      <convolution_data dilation-y="1" output="128" dilation-x="1" kernel-y="3" kernel-x="3" pad-y="1" pad-x="1" stride-y="2" group="1" stride-x="2"/>
      <input>
        <port id="72">
          <dim>1</dim>
          <dim>128</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="71">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="294912" offset="514828"/>
      <biases size="256" offset="809740"/>
    </layer>
    <layer precision="FP16" id="36" type="ReLU" name="ReLU_stage2_unit1_relu3">
      <input>
        <port id="74">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="73">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="37" type="Convolution" name="Convolution_stage2_unit1_conv3">
      <convolution_data dilation-y="1" output="512" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="76">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="75">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="131072" offset="809996"/>
    </layer>
    <layer precision="FP16" id="38" type="Convolution" name="Convolution_stage2_unit1_sc">
      <convolution_data dilation-y="1" output="512" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="2" group="1" stride-x="2"/>
      <input>
        <port id="78">
          <dim>1</dim>
          <dim>256</dim>
          <dim>56</dim>
          <dim>56</dim>
        </port>
      </input>
      <output>
        <port id="77">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="262144" offset="941068"/>
    </layer>
    <layer precision="FP16" id="39" type="Eltwise" name="Eltwise__plus3">
      <elementwise_data operation="sum"/>
      <input>
        <port id="80">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
        <port id="81">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="79">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="40" type="ScaleShift" name="ScaleShift_stage2_unit2_bn1">
      <input>
        <port id="83">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="82">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="1024" offset="1203212"/>
      <biases size="1024" offset="1204236"/>
    </layer>
    <layer precision="FP16" id="41" type="ReLU" name="ReLU_stage2_unit2_relu1">
      <input>
        <port id="85">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="84">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="42" type="Convolution" name="Convolution_stage2_unit2_conv1">
      <convolution_data dilation-y="1" output="128" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="87">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="86">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="131072" offset="1205260"/>
      <biases size="256" offset="1336332"/>
    </layer>
    <layer precision="FP16" id="43" type="ReLU" name="ReLU_stage2_unit2_relu2">
      <input>
        <port id="89">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="88">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="44" type="Convolution" name="Convolution_stage2_unit2_conv2">
      <convolution_data dilation-y="1" output="128" dilation-x="1" kernel-y="3" kernel-x="3" pad-y="1" pad-x="1" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="91">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="90">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="294912" offset="1336588"/>
      <biases size="256" offset="1631500"/>
    </layer>
    <layer precision="FP16" id="45" type="ReLU" name="ReLU_stage2_unit2_relu3">
      <input>
        <port id="93">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="92">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="46" type="Convolution" name="Convolution_stage2_unit2_conv3">
      <convolution_data dilation-y="1" output="512" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="95">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="94">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="131072" offset="1631756"/>
    </layer>
    <layer precision="FP16" id="47" type="Eltwise" name="Eltwise__plus4">
      <elementwise_data operation="sum"/>
      <input>
        <port id="97">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
        <port id="98">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="96">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="48" type="ScaleShift" name="ScaleShift_stage2_unit3_bn1">
      <input>
        <port id="100">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="99">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="1024" offset="1762828"/>
      <biases size="1024" offset="1763852"/>
    </layer>
    <layer precision="FP16" id="49" type="ReLU" name="ReLU_stage2_unit3_relu1">
      <input>
        <port id="102">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="101">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="50" type="Convolution" name="Convolution_stage2_unit3_conv1">
      <convolution_data dilation-y="1" output="128" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="104">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="103">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="131072" offset="1764876"/>
      <biases size="256" offset="1895948"/>
    </layer>
    <layer precision="FP16" id="51" type="ReLU" name="ReLU_stage2_unit3_relu2">
      <input>
        <port id="106">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="105">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="52" type="Convolution" name="Convolution_stage2_unit3_conv2">
      <convolution_data dilation-y="1" output="128" dilation-x="1" kernel-y="3" kernel-x="3" pad-y="1" pad-x="1" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="108">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="107">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="294912" offset="1896204"/>
      <biases size="256" offset="2191116"/>
    </layer>
    <layer precision="FP16" id="53" type="ReLU" name="ReLU_stage2_unit3_relu3">
      <input>
        <port id="110">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="109">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="54" type="Convolution" name="Convolution_stage2_unit3_conv3">
      <convolution_data dilation-y="1" output="512" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="112">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="111">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="131072" offset="2191372"/>
    </layer>
    <layer precision="FP16" id="55" type="Eltwise" name="Eltwise__plus5">
      <elementwise_data operation="sum"/>
      <input>
        <port id="114">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
        <port id="115">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="113">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="56" type="ScaleShift" name="ScaleShift_stage2_unit4_bn1">
      <input>
        <port id="117">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="116">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="1024" offset="2322444"/>
      <biases size="1024" offset="2323468"/>
    </layer>
    <layer precision="FP16" id="57" type="ReLU" name="ReLU_stage2_unit4_relu1">
      <input>
        <port id="119">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="118">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="58" type="Convolution" name="Convolution_stage2_unit4_conv1">
      <convolution_data dilation-y="1" output="128" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="121">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="120">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="131072" offset="2324492"/>
      <biases size="256" offset="2455564"/>
    </layer>
    <layer precision="FP16" id="59" type="ReLU" name="ReLU_stage2_unit4_relu2">
      <input>
        <port id="123">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="122">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="60" type="Convolution" name="Convolution_stage2_unit4_conv2">
      <convolution_data dilation-y="1" output="128" dilation-x="1" kernel-y="3" kernel-x="3" pad-y="1" pad-x="1" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="125">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="124">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="294912" offset="2455820"/>
      <biases size="256" offset="2750732"/>
    </layer>
    <layer precision="FP16" id="61" type="ReLU" name="ReLU_stage2_unit4_relu3">
      <input>
        <port id="127">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="126">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="62" type="Convolution" name="Convolution_stage2_unit4_conv3">
      <convolution_data dilation-y="1" output="512" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="129">
          <dim>1</dim>
          <dim>128</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="128">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="131072" offset="2750988"/>
    </layer>
    <layer precision="FP16" id="63" type="Eltwise" name="Eltwise__plus6">
      <elementwise_data operation="sum"/>
      <input>
        <port id="131">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
        <port id="132">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="130">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="64" type="ScaleShift" name="ScaleShift_stage3_unit1_bn1">
      <input>
        <port id="134">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="133">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="1024" offset="2882060"/>
      <biases size="1024" offset="2883084"/>
    </layer>
    <layer precision="FP16" id="65" type="ReLU" name="ReLU_stage3_unit1_relu1">
      <input>
        <port id="136">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="135">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="66" type="Convolution" name="Convolution_stage3_unit1_conv1">
      <convolution_data dilation-y="1" output="256" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="138">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="137">
          <dim>1</dim>
          <dim>256</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
      <weights size="262144" offset="2884108"/>
      <biases size="512" offset="3146252"/>
    </layer>
    <layer precision="FP16" id="67" type="ReLU" name="ReLU_stage3_unit1_relu2">
      <input>
        <port id="140">
          <dim>1</dim>
          <dim>256</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="139">
          <dim>1</dim>
          <dim>256</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="68" type="Convolution" name="Convolution_stage3_unit1_conv2">
      <convolution_data dilation-y="1" output="256" dilation-x="1" kernel-y="3" kernel-x="3" pad-y="1" pad-x="1" stride-y="2" group="1" stride-x="2"/>
      <input>
        <port id="142">
          <dim>1</dim>
          <dim>256</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="141">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
      <weights size="1179648" offset="3146764"/>
      <biases size="512" offset="4326412"/>
    </layer>
    <layer precision="FP16" id="69" type="ReLU" name="ReLU_stage3_unit1_relu3">
      <input>
        <port id="144">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="143">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="70" type="Convolution" name="Convolution_stage3_unit1_conv3">
      <convolution_data dilation-y="1" output="1024" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="146">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="145">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
      <weights size="524288" offset="4326924"/>
    </layer>
    <layer precision="FP16" id="71" type="Convolution" name="Convolution_stage3_unit1_sc">
      <convolution_data dilation-y="1" output="1024" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="2" group="1" stride-x="2"/>
      <input>
        <port id="148">
          <dim>1</dim>
          <dim>512</dim>
          <dim>28</dim>
          <dim>28</dim>
        </port>
      </input>
      <output>
        <port id="147">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
      <weights size="1048576" offset="4851212"/>
    </layer>
    <layer precision="FP16" id="72" type="Eltwise" name="Eltwise__plus7">
      <elementwise_data operation="sum"/>
      <input>
        <port id="150">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
        <port id="151">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="149">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="73" type="ScaleShift" name="ScaleShift_stage3_unit2_bn1">
      <input>
        <port id="153">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="152">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
      <weights size="2048" offset="5899788"/>
      <biases size="2048" offset="5901836"/>
    </layer>
    <layer precision="FP16" id="74" type="ReLU" name="ReLU_stage3_unit2_relu1">
      <input>
        <port id="155">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="154">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="75" type="Convolution" name="Convolution_stage3_unit2_conv1">
      <convolution_data dilation-y="1" output="256" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="157">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="156">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
      <weights size="524288" offset="5903884"/>
      <biases size="512" offset="6428172"/>
    </layer>
    <layer precision="FP16" id="76" type="ReLU" name="ReLU_stage3_unit2_relu2">
      <input>
        <port id="159">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="158">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="77" type="Convolution" name="Convolution_stage3_unit2_conv2">
      <convolution_data dilation-y="1" output="256" dilation-x="1" kernel-y="3" kernel-x="3" pad-y="1" pad-x="1" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="161">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="160">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
      <weights size="1179648" offset="6428684"/>
      <biases size="512" offset="7608332"/>
    </layer>
    <layer precision="FP16" id="78" type="ReLU" name="ReLU_stage3_unit2_relu3">
      <input>
        <port id="163">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="162">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="79" type="Convolution" name="Convolution_stage3_unit2_conv3">
      <convolution_data dilation-y="1" output="1024" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="165">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="164">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
      <weights size="524288" offset="7608844"/>
    </layer>
    <layer precision="FP16" id="80" type="Eltwise" name="Eltwise__plus8">
      <elementwise_data operation="sum"/>
      <input>
        <port id="167">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
        <port id="168">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="166">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="81" type="ScaleShift" name="ScaleShift_stage3_unit3_bn1">
      <input>
        <port id="170">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="169">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
      <weights size="2048" offset="8133132"/>
      <biases size="2048" offset="8135180"/>
    </layer>
    <layer precision="FP16" id="82" type="ReLU" name="ReLU_stage3_unit3_relu1">
      <input>
        <port id="172">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="171">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="83" type="Convolution" name="Convolution_stage3_unit3_conv1">
      <convolution_data dilation-y="1" output="256" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="174">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="173">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
      <weights size="524288" offset="8137228"/>
      <biases size="512" offset="8661516"/>
    </layer>
    <layer precision="FP16" id="84" type="ReLU" name="ReLU_stage3_unit3_relu2">
      <input>
        <port id="176">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="175">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="85" type="Convolution" name="Convolution_stage3_unit3_conv2">
      <convolution_data dilation-y="1" output="256" dilation-x="1" kernel-y="3" kernel-x="3" pad-y="1" pad-x="1" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="178">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="177">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
      <weights size="1179648" offset="8662028"/>
      <biases size="512" offset="9841676"/>
    </layer>
    <layer precision="FP16" id="86" type="ReLU" name="ReLU_stage3_unit3_relu3">
      <input>
        <port id="180">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="179">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="87" type="Convolution" name="Convolution_stage3_unit3_conv3">
      <convolution_data dilation-y="1" output="1024" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="182">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="181">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
      <weights size="524288" offset="9842188"/>
    </layer>
    <layer precision="FP16" id="88" type="Eltwise" name="Eltwise__plus9">
      <elementwise_data operation="sum"/>
      <input>
        <port id="184">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
        <port id="185">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="183">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="89" type="ScaleShift" name="ScaleShift_stage3_unit4_bn1">
      <input>
        <port id="187">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="186">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
      <weights size="2048" offset="10366476"/>
      <biases size="2048" offset="10368524"/>
    </layer>
    <layer precision="FP16" id="90" type="ReLU" name="ReLU_stage3_unit4_relu1">
      <input>
        <port id="189">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="188">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
    </layer>
    <layer precision="FP16" id="91" type="Convolution" name="Convolution_stage3_unit4_conv1">
      <convolution_data dilation-y="1" output="256" dilation-x="1" kernel-y="1" kernel-x="1" pad-y="0" pad-x="0" stride-y="1" group="1" stride-x="1"/>
      <input>
        <port id="191">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </input>
      <output>
        <port id="190">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
          <dim>14</dim>
        </port>
      </output>
      <weights size="524288" offset="10370572"/>
      <biases size="512" offset="10894860"/>
    </layer>
    <layer precision="FP16" id="92" type="ReLU" name="ReLU_stage3_unit4_relu2">
      <input>
        <port id="193">
          <dim>1</dim>
          <dim>256</dim>
          <dim>14</dim>
